---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ClientName
source: html/173d5b53-8850-9b5a-fc63-04622b9d1e3e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ClientName Property

"Client Name"

## Syntax (C#)
```csharp
public static ForgeTypeId ClientName { get; }
```